nathanlnw/HB_gghypt/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
/*
     SMS.C 
*/
#include <rtthread.h> 
#include <rthw.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>

#include  <stdlib.h>//数字转换成字符串
#include  <stdio.h>
#include  <string.h>
#include  "App_moduleConfig.h"
#include  "App_gsm.h"
#include  "SMS.h"


SMS_Style   SMS_Service;    //  短息相关    


/*********************************************************************************
*函数名称:void SMS_timer(u8 *instr,u16 len)
*功能描述:短信处理函数，这个函数需要在一个1秒的定时器里面调用，用于函数"SMS_Process"的定时处理等
*输    入:none
*输    出:none 
*返 回 值:none
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void SMS_timer(void)
{
	if(SMS_Service.SMS_waitCounter)
		SMS_Service.SMS_waitCounter--;
}


/*********************************************************************************
*函数名称:void SMS_Process(u8 *instr,u16 len)
*功能描述:短信处理函数，这个函数需要在一个线程里面调用，进行相关处理(短信读取，删除和自动发送相关)
*输    入:none
*输    出:none 
*返 回 值:none
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
void SMS_Process(void) 
{
	u16   	ContentLen=0;
//	u16 		i,j,k;
	char *pstrTemp;
	if(SMS_Service.SMS_waitCounter)
		return;
	//-----------  短信处理相关 -------------------------------------------------------- 
	//---------------------------------
	if(SMS_Service.SMS_read)	   // 读取短信
	{
		memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
		/*
		strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGR=" );	  
		if ( SMS_Service.SMIndex > 9 )
		{
			SMS_Service.SMSAtSend[8] = ( SMS_Service.SMIndex >> 4 ) + 0x30;
			SMS_Service.SMSAtSend[9] = ( SMS_Service.SMIndex & 0x0f ) + 0x30;
			SMS_Service.SMSAtSend[10] = 0x0d;
			SMS_Service.SMSAtSend[11] = 0x0a;
		}
		else
		{
			SMS_Service.SMSAtSend[8] = ( SMS_Service.SMIndex & 0x0f ) + 0x30;
			SMS_Service.SMSAtSend[9] = 0x0d;
			SMS_Service.SMSAtSend[10] = 0x0a;
		}
		rt_kprintf("\r\n%s",SMS_Service.SMSAtSend); 
		*/
		///
		sprintf(SMS_Service.SMSAtSend,"AT+CMGR=%d\r\n",SMS_Service.SMIndex);
		rt_kprintf("%s",SMS_Service.SMSAtSend); 
		///
		rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );   		
		SMS_Service.SMS_read--;  
		SMS_Service.SMS_waitCounter=3;
	}
	//-------------------------------
	//       发送短息确认
	else
	if(SMS_Service.SMS_sendFlag==1)
	{
		//#ifdef SMS_TYPE_PDU
		if(SMS_Service.SMS_come==1)
		{
			memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
			///申请400字节空间
			pstrTemp=rt_malloc(400);
			memset(pstrTemp,0,400);
			///将字符串格式的目的电话号码设置为PDU格式的号码
			SetPhoneNumToPDU(SMS_Service.Sms_Info.TPA, SMS_Service.SMS_destNum, sizeof(SMS_Service.Sms_Info.TPA));
			///生成PDU格式短信内容
			ContentLen=AnySmsEncode_NoCenter(SMS_Service.Sms_Info.TPA,GSM_UCS2,SMS_Service.SMS_sd_Content,strlen(SMS_Service.SMS_sd_Content),pstrTemp);
			//ContentLen=strlen(pstrTemp);
			///添加短信尾部标记"esc"
			pstrTemp[ContentLen]=0x1A;      // message  end  	
			//////
			sprintf( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=%d\r\n", (ContentLen-2)/2); 
			rt_kprintf("%s",SMS_Service.SMSAtSend); 
			rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );
			rt_thread_delay(50);
			//////	
			//rt_kprintf("%s",pstrTemp); 
			rt_device_write( &dev_vuart, 0, pstrTemp, strlen(pstrTemp) );
			rt_hw_gsm_output_Data( ( char * ) pstrTemp, ContentLen+1); 
			rt_free( pstrTemp );
			pstrTemp=RT_NULL;
		}
		//#else
		else
		{
			memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
			strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=\"" ); 
			//strcat(SMS_Service.SMSAtSend,"8613820554863");// Debug
			strcat(SMS_Service.SMSAtSend,SMS_Service.SMS_destNum);
			strcat(SMS_Service.SMSAtSend,"\"\r\n");

			rt_kprintf("\r\n%s",SMS_Service.SMSAtSend); 
			rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );

			rt_thread_delay(50);
			ContentLen=strlen(SMS_Service.SMS_sd_Content);
			SMS_Service.SMS_sd_Content	[ContentLen]=0x1A;      // message  end  		
			rt_kprintf("%s",SMS_Service.SMS_sd_Content); 
			rt_hw_gsm_output_Data( ( char * ) SMS_Service.SMS_sd_Content, ContentLen+1); 
		}
		//#endif
		SMS_Service.SMS_sendFlag=0;  // clear 
		SMS_Service.SMS_waitCounter=3;
	} 
	/*
	else if(SMS_Service.SMS_delALL==1)	  //删除短信
	{	   
		memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
		///
		//sprintf(SMS_Service.SMSAtSend,"AT+CMGD=%d\r\n",SMS_Service.SMIndex);
		sprintf(SMS_Service.SMSAtSend,"AT+CMGD=0,4\r\n",SMS_Service.SMIndex);
		rt_kprintf("%s",SMS_Service.SMSAtSend); 
		///
		rt_hw_gsm_output( ( char * )SMS_Service.SMSAtSend ); 
		SMS_Service.SMS_delALL=0; 
		SMS_Service.SMS_waitCounter=3;
	}
	*/
}


///增加发送短信区域的内容，并置位发送短息标记，成功返回true，失败返回false
u8 Add_SMS_Ack_Content(char * instr,u8 ACKflag)
{
    if(ACKflag==0)
		 return false;  
     
	if(strlen(instr)+strlen(SMS_Service.SMS_sd_Content) < sizeof(SMS_Service.SMS_sd_Content))
		{
		 	strcat((char *)SMS_Service.SMS_sd_Content,instr);
			//rt_kprintf(" \r\n  enable  send msg! \r\n"); 
		 	SMS_Service.SMS_sendFlag=1;
			return true;
		}
	return false;
}

/*********************************************************************************
*函数名称:void SMS_protocol(u8 *instr,u16 len)
*功能描述:接收到短信后参数处理函数
*输    入:instr原始短信数据，len长度
*输    出:none 
*返 回 值:none
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/				
void   SMS_protocol (u8 *instr,u16 len, u8  ACKstate)   //  ACKstate 
{
	char	sms_content[60];		///短信命令区"()"之间的内容
	char	sms_ack_data[60];		///短信每个命令包括'#'符的完整内容
	u8	u8TempBuf[6];
	u16	i=0,j=0;
	u16  cmdLen,u16Temp;
	char *p_Instr;
	char *pstrTemp,*pstrTempStart,*pstrTempEnd;

	//SYSID		///修改该值，保存flash
	///应答短信包头部分
	memset(SMS_Service.SMS_sd_Content,0,sizeof(SMS_Service.SMS_sd_Content));
	strcpy(SMS_Service.SMS_sd_Content,Vechicle_Info.Vech_Num);
	strcat(SMS_Service.SMS_sd_Content,"#");// Debug
	strcat(SMS_Service.SMS_sd_Content,SimID_12D);// Debug
	strcat(SMS_Service.SMS_sd_Content,"#V3");// 版本信息 
	/*************************处理信息****************************/
	p_Instr=(char *)instr;
	for(i=0;i<len;i++)
		{
		pstrTemp=strchr(p_Instr,'#');					///查找命令是否存在
		//instr++;
		if(pstrTemp)
			{
			p_Instr=pstrTemp+1;
			pstrTempStart=strchr((char *)pstrTemp,'(');			///查找命令内容开始位置
			pstrTempEnd=strchr((char *)pstrTemp,')');			///查找命令内容结束位置
			if((NULL==pstrTempStart)||(NULL==pstrTempEnd))
				{
				break;
				}
			rt_kprintf("\r\n短信命令格式有效 !");
			///获取命令内容
			memset(sms_ack_data,0,sizeof(sms_ack_data));
			memcpy(sms_ack_data,pstrTemp,pstrTempEnd-pstrTemp+1);

			///获取命令参数区域的内容以及参数长度
			pstrTempStart++;
			pstrTemp++;
			cmdLen=pstrTempEnd-pstrTempStart;
			memset(sms_content,0,sizeof(sms_content));
			rt_memcpy(sms_content,pstrTempStart,cmdLen);
            if(strncmp(pstrTemp,"GGHYPT",6)==0)
            	{
            	if(sms_content[0]=='0')//标准模式
            	  	{
            	  	Vechicle_Info.Vech_MODE_Mark=2; //标准模式
            	  	dnsr_main(TDT_MainDnsStr);////修改DNS后  清空鉴权码
            	  	dnsr_aux(TDT_AuxDnsStr);////修改DNS后  清空鉴权码
					port_main("8201");
					link_mode("0");	
					idip("clear");	

					memset((u8*)SysConf_struct.DNSR,0 ,sizeof(SysConf_struct.DNSR));
					memcpy(SysConf_struct.DNSR,TDT_MainDnsStr,strlen(DomainNameStr));
					memset((u8*)SysConf_struct.DNSR_Aux,0 ,sizeof(SysConf_struct.DNSR_Aux));
					memcpy(SysConf_struct.DNSR_Aux,TDT_AuxDnsStr,strlen(DomainNameStr_aux));   
					
            	  	rt_kprintf("\r\n 切换到  标准模式");
            	  	}
		        else if(sms_content[0]=='1')//货运模式
		          	{
		          	Vechicle_Info.Vech_MODE_Mark=1;//货运模式
		          	dnsr_main("jt1.gghypt.net");//修改DNS后  清空鉴权码
		          	dnsr_aux("jt2.gghypt.net");//修改DNS后  清空鉴权码
					port_main("7008");
					link_mode("0");//DNS 优先
					idip("clear");	

					memset((u8*)SysConf_struct.DNSR,0 ,sizeof(SysConf_struct.DNSR));
					memcpy(SysConf_struct.DNSR,DomainNameStr,strlen(DomainNameStr)); 
					memset((u8*)SysConf_struct.DNSR_Aux,0 ,sizeof(SysConf_struct.DNSR_Aux));
					memcpy(SysConf_struct.DNSR_Aux,DomainNameStr_aux,strlen(DomainNameStr_aux));   

                    rt_kprintf("\r\n 切换到  货运模式");
		          	}
				Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct)); 
				if( Api_Config_read(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct))==true)   //读取系统配置信息
					{
					//   域名
					memset((u8*)DomainNameStr,0 ,sizeof(DomainNameStr));
					memcpy((u8*)DomainNameStr,SysConf_struct.DNSR,strlen((const char*)SysConf_struct.DNSR)); 
					//   域名aux
					memset((u8*)DomainNameStr_aux,0 ,sizeof(DomainNameStr_aux));
					memcpy((u8*)DomainNameStr_aux,SysConf_struct.DNSR_Aux,strlen((const char*)SysConf_struct.DNSR_Aux)); 
					}
				
				DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				WatchDog_Feed();
				DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				WatchDog_Feed();
				DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));

                           //  Vechicle  compare
			    DF_ReadFlash(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));   	   
			    WatchDog_Feed();
			    DF_ReadFlash(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info_BAK,sizeof(Vechicle_Info_BAK)); 
			    WatchDog_Feed();
			    DF_ReadFlash(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_info_BAK2,sizeof(Vechicle_info_BAK2)); 

                
	            rt_kprintf("\r\n 返回短信");
				Add_SMS_Ack_Content(sms_ack_data,ACKstate);
            	}
			///进行命令匹配
			else if(strncmp(pstrTemp,"DNSR",4)==0)				///  1. 设置域名
				{
				if(cmdLen<=sizeof(DomainNameStr))
					{
					if(pstrTemp[4]=='1')		///主域名
						{
						rt_kprintf("\r\n设置主域名 !");
						memset(DomainNameStr,0,sizeof(DomainNameStr));					  
						memset(SysConf_struct.DNSR,0,sizeof(DomainNameStr));  
						memcpy(DomainNameStr,(char*)pstrTempStart,cmdLen);
						memcpy(SysConf_struct.DNSR,(char*)pstrTempStart,cmdLen);
						Api_Config_write(config,ID_CONF_SYS,(u8*)&SysConf_struct,sizeof(SysConf_struct));
						//----- 传给 GSM 模块------
						DataLink_DNSR_Set(SysConf_struct.DNSR,1); 
						
						///
						Add_SMS_Ack_Content(sms_ack_data,ACKstate);

						//------- add on 2013-6-6
						if(ACKstate==SMS_ACK_none)
						     SD_ACKflag.f_CentreCMDack_0001H=2 ;//DataLink_EndFlag=1; //AT_End(); 先返回结果再挂断  
						else
							   DataLink_EndFlag=1; //AT_End();  
							   
                         //--------    清除鉴权码 -------------------
					     idip("clear");		   

