nathanlnw/HB_gghypt/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
            	}
			else if(strncmp(pstrTemp,"RESET",5)==0)			///10.终端重启
				{
				      reset();
				}
			else if(strncmp(pstrTemp,"RELAY",5)==0)			///11.继电器控制
				{
				       if(sms_content[0]=='0')
				              debug_relay("0");
				       if(sms_content[0]=='1')
					   	debug_relay("1"); 

					Add_SMS_Ack_Content(sms_ack_data,ACKstate);	    
				}
			else if(strncmp(pstrTemp,"TAKE",4)==0)				//12./拍照
				{
				    switch(sms_content[0])
				   {
                                    case '1':
                                                 takephoto("1");
							break;		
					case '2':
                                                  takephoto("2"); 
							break;		
				       case '3':
                                                takephoto("3");
							break;	
				       case '4':
                                                  takephoto("4");
							break;
				   }
				    Add_SMS_Ack_Content(sms_ack_data,ACKstate);	
				}
			else if(strncmp(pstrTemp,"PLAY",4)==0)				///13.语音播报
				{
				     TTS_Get_Data(sms_content,strlen(sms_content));
				     Add_SMS_Ack_Content(sms_ack_data,ACKstate);		  
				}
			else if(strncmp(pstrTemp,"QUERY",5)==0)			///14.车辆状态查询
				{
				       switch(sms_content[0])
				     	{
				     	    case '0':  // 终端号  主域名  主端口
								     
									 strcat((char *)SMS_Service.SMS_sd_Content,sms_ack_data);
									 strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                     strcat(SMS_Service.SMS_sd_Content,DeviceNumberID);// 终端ID
                                     strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                     strcat(SMS_Service.SMS_sd_Content,DomainNameStr);// 分隔符号
                                     strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                     sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d",RemotePort_main); 
								
								   break;
							case '1':  // MODE    主IP   主端口
								    strcat((char *)SMS_Service.SMS_sd_Content,sms_ack_data);
									strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
									if(Vechicle_Info.Link_Frist_Mode==1)  
                                         strcat(SMS_Service.SMS_sd_Content,"MODE(mainlink)");
									else
                                         strcat(SMS_Service.SMS_sd_Content,"MODE(dnsr)");
									strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
									IP_Str(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content), *( u32 * ) RemoteIP_main);
								    strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                    sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d",RemotePort_main);  
												
								    break;
                            case '2':
								    strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                    strcat(SMS_Service.SMS_sd_Content,Posit_ASCII.Lat_ASCII);// 分隔符号
                                    strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                    strcat(SMS_Service.SMS_sd_Content,Posit_ASCII.Longi_ASCII);// 分隔符号
                                    strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                    strcat(SMS_Service.SMS_sd_Content,&Posit_ASCII.AV_ASCII);// 分隔符号
									strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
								    if(GpsStatus.Position_Moule_Status==1)
									{
									  strcat(SMS_Service.SMS_sd_Content,"BD");
									}
								else if(GpsStatus.Position_Moule_Status==2)
									{
									  strcat(SMS_Service.SMS_sd_Content,"GPS");
									}
								else if(GpsStatus.Position_Moule_Status==3)
									{
									  strcat(SMS_Service.SMS_sd_Content,"BD+GPS");
									}
                                     strcat(SMS_Service.SMS_sd_Content,"#");// 分隔符号
                                     sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d",ModuleSQ); 
								
								    break; 
						   case '3':  // 省域ID  市域ID
						   	       strcat(SMS_Service.SMS_sd_Content,"#provinceid(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d",Vechicle_Info.Dev_ProvinceID); 
							       strcat(SMS_Service.SMS_sd_Content,")#");// 分隔符号							       
						   	       strcat(SMS_Service.SMS_sd_Content,"cityid(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d)",Vechicle_Info.Dev_CityID); 
								   strcat(SMS_Service.SMS_sd_Content,"#Online(");// 分隔符号								   
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d)",DataLink_Status());
								   break;
						   case '4': 		 //速度 传感器   
								   strcat(SMS_Service.SMS_sd_Content,"#SpdType(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d)", JT808Conf_struct.Speed_GetType); 
								   strcat(SMS_Service.SMS_sd_Content,"#Adjust(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d)", JT808Conf_struct.DF_K_adjustState);
								   strcat(SMS_Service.SMS_sd_Content,"#PlusNum(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d)", JT808Conf_struct.Vech_Character_Value);
								   break;
						    case '5': 		   
								    strcat(SMS_Service.SMS_sd_Content,"#gpsspd(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d km/h)", Speed_gps/10);
								    strcat(SMS_Service.SMS_sd_Content,"#sensor(");// 分隔符号						   	       
							       sprintf(SMS_Service.SMS_sd_Content+strlen(SMS_Service.SMS_sd_Content),"%d km/h)", Speed_cacu/10);  
								   
           					        break; 
				     	}	
					   
					    if(ACKstate)
							SMS_Service.SMS_sendFlag=1;  // 发送返回短息标志位
				}
			else if(strncmp(pstrTemp,"ISP",3)==0)				///15.远程下载IP 端口
				{
				     ;
				    Add_SMS_Ack_Content(sms_ack_data,ACKstate);		 
				}
			else if(strncmp(pstrTemp,"PLATENUM",8)==0)
				{
				    rt_kprintf("车牌号:%s", sms_content); 
					memset((u8*)&Vechicle_Info.Vech_Num,0,sizeof(Vechicle_Info.Vech_Num));	//clear	
				    rt_memcpy(Vechicle_Info.Vech_Num,sms_content,strlen(sms_content));
					DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 					
					WatchDog_Feed();
					DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
					
