nathanlnw/HB_gghypt/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
					WatchDog_Feed();
					DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
					
					Add_SMS_Ack_Content(sms_ack_data,ACKstate);

					Login_Menu_Flag=1;	   // clear  first flag 	 			
			        DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 

					 //--------    清除鉴权码 -------------------
					     idip("clear");		   
				}
			else if(strncmp(pstrTemp,"COLOUR",6)==0)
				{
				     j=sscanf(sms_content,"%d",&u16Temp);
					if(j)
					{
						
					Vechicle_Info.Dev_Color=u16Temp; 
	        		rt_kprintf("\r\n 车辆颜色: %s ,%d \r\n",sms_content,Vechicle_Info.Dev_Color);          
	        		DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));  
					
					WatchDog_Feed();
					DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
					
					WatchDog_Feed();
					DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
				  	Add_SMS_Ack_Content(sms_ack_data,ACKstate);
					}
				}
			else if(strncmp(pstrTemp,"CONNECT",6)==0)
				{
				    j=sscanf(sms_content,"%d",&u16Temp);
					if(j)
					{
						
						Vechicle_Info.Link_Frist_Mode=u16Temp;  
		        		rt_kprintf("\r\n 首次连接方式 %s ,%d \r\n",sms_content,Vechicle_Info.Link_Frist_Mode);          
						DF_WriteFlashSector(DF_Vehicle_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info));		
						
						WatchDog_Feed();
						DF_WriteFlashSector(DF_VehicleBAK_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
						
						WatchDog_Feed();
						DF_WriteFlashSector(DF_VehicleBAK2_Struct_offset,0,(u8*)&Vechicle_Info,sizeof(Vechicle_Info)); 
					  	Add_SMS_Ack_Content(sms_ack_data,ACKstate);  
						 //--------    清除鉴权码 -------------------
					     idip("clear");		   
					} 
				}
           else if(strncmp(pstrTemp,"CLEARREGIST",11)==0)
           	    {
                     //--------    清除鉴权码 -------------------
					     idip("clear");		
                     DEV_regist.Enable_sd=1; // set 发送注册标志位
			         DataLink_EndFlag=1; 
					 Add_SMS_Ack_Content(sms_ack_data,ACKstate);  //  ack  state
           	    }
		   //  20
	        else if(strncmp(pstrTemp,"PASSWORD",8)==0)  //设置密码通过
       	    {
                j=sscanf(sms_content,"%d",&u16Temp);
				if(j)
				{
				  Login_Menu_Flag=(u8)u16Temp;	   // clear  first flag 	 			
			      DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 
			
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate);  //  ack  state
				    if(Login_Menu_Flag)
				    	{
				    	  //--------    清除鉴权码 -------------------
					      idip("clear");
						  DEV_regist.Enable_sd=1; // set 发送注册标志位
			              DataLink_EndFlag=1; 
				    	}
				} 
       	    } 
			else if(strncmp(pstrTemp,"RECOVER",7)==0)
				{
                     //------  界面回复出厂设置
					 Login_Menu_Flag=0;	  // clear	first flag		 
					 DF_WriteFlashSector(DF_LOGIIN_Flag_offset,0,&Login_Menu_Flag,1); 

					 Add_SMS_Ack_Content(sms_ack_data,ACKstate);  //  ack  state                  
                     Systerm_Reset_counter=Max_SystemCounter-30; //返回短信后恢复出厂设置
					 
				} //provinceid
			else if(strncmp(pstrTemp,"PROVINCEID",10)==0)
			{
                  provinceid(sms_content);
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate);
				 
			}	
			else if(strncmp(pstrTemp,"CITYID",6)==0)
			{
                  cityid(sms_content); 
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate); 
				 
			}
		    else if(strncmp(pstrTemp,"ATAENABLE",9)==0)
			{
			    j=sscanf(sms_content,"%d",&u16Temp);
				if(j)
				{
                  ata_enable(u16Temp); 
				  Add_SMS_Ack_Content(sms_ack_data,ACKstate);  
				}
				 
			}
			if(strncmp(pstrTemp,"SPDTYPE",6)==0)
				{
				    j=sscanf(sms_content,"%d",&u16Temp);
					if(j)
					{
						spd_type(u16Temp);//   0: GPS 速度   1:  传感器速度
					  	Add_SMS_Ack_Content(sms_ack_data,ACKstate);  
				   
					} 
				}
			else
			if(strncmp(pstrTemp,"ADJUST",6)==0)
				{
				    j=sscanf(sms_content,"%d",&u16Temp);
					if(j)
					{
						adjust_ok(u16Temp);//   0: GPS 速度   1:  传感器速度
					  	Add_SMS_Ack_Content(sms_ack_data,ACKstate);  
				   
					} 
				}	
			else	
			if(strncmp(pstrTemp,"PLUSNUM",6)==0) 
			{
						j=sscanf(sms_content,"%d",&u16Temp);
						if(j)
						{
							plus_num(u16Temp);//	0: GPS 速度   1:  传感器速度 
							Add_SMS_Ack_Content(sms_ack_data,ACKstate);  
					   
						} 
					}	
			}
		else
			{
			break;
			}
		}
}



/*********************************************************************************
*函数名称:u8 SMS_Rx_Text(char *instr,char *strDestNum)
*功能描述:接收到TEXT格式的短信处理函数
*输    入:instr 原始短信数据，strDestNum接收到得信息的发送方号码
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_Text(char *instr,char *strDestNum)
{
	u16 len;
	u8 ret=0;
	len=strlen(strDestNum);
	memset( SMS_Service.SMS_destNum, 0, sizeof( SMS_Service.SMS_destNum ) );
	if(len>sizeof( SMS_Service.SMS_destNum ))
		{
		len=sizeof( SMS_Service.SMS_destNum );
		}
	memcpy(SMS_Service.SMS_destNum,strDestNum,len);
	rt_kprintf( "\r\n  短息来源号码:%s", SMS_Service.SMS_destNum );
	
	len=strlen(instr);
	rt_kprintf( "\r\n 短信收到消息: " );
	rt_device_write( &dev_vuart, 0, instr, len);
	
	if( strncmp( (char*)instr, "TW703#", 6 ) == 0 )                                                //短信修改UDP的IP和端口
	{
		//-----------  自定义 短息设置修改 协议 ----------------------------------
		SMS_protocol( instr + 5, len - 5 ,SMS_ACK_msg);
		ret=1;
	}
	SMS_Service.SMS_read		= 0;
	SMS_Service.SMS_waitCounter = 0;
	SMS_Service.SMS_come		= 0;
	//SMS_Service.SMS_delALL		= 1;
	return ret;
}


/*********************************************************************************
*函数名称:u8 SMS_Rx_PDU(char *instr,u16 len)
*功能描述:接收到PDU格式的短信处理函数
*输    入:instr 原始短信数据，len接收到得信息长度，单位为字节
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_PDU(char *instr,u16 len)
{
	char *pstrTemp;
	u8 ret=0;
	
