nathanlnw/HB_gghypt/bsp/stm32f407vgt6_RecDrv/app_712/gsm/SMS.c
	//////
	memset( SMS_Service.SMS_destNum, 0, sizeof( SMS_Service.SMS_destNum ) );
	pstrTemp=(char *)rt_malloc(200);	///短信解码后的完整内容，解码后汉子为GB码
	memset(pstrTemp,0,200);
	rt_kprintf( "\r\n 短信原始消息: " );
	rt_device_write( &dev_vuart, 0, GSM_rx, len );
	
	len=GsmDecodePdu(GSM_rx,len,&SMS_Service.Sms_Info,pstrTemp);
	GetPhoneNumFromPDU( SMS_Service.SMS_destNum,  SMS_Service.Sms_Info.TPA, sizeof(SMS_Service.Sms_Info.TPA));

	//memcpy( SMS_Service.SMS_destNum, SMS_Service.Sms_Info.TPA,sizeof( SMS_Service.SMS_destNum ) );
	rt_kprintf( "\r\n  短息来源号码:%s \r\n", SMS_Service.SMS_destNum );
	rt_kprintf( "\r\n 短信消息: " ); 
	rt_device_write( &dev_vuart, 0, pstrTemp, len );
	//rt_hw_console_output(GSM_rx);
	if( strncmp( (char*)pstrTemp, "TW703#", 6 ) == 0 )                                                //短信修改UDP的IP和端口
	{
		//-----------  自定义 短息设置修改 协议 ----------------------------------
		SMS_protocol( pstrTemp + 5, len - 5 ,SMS_ACK_msg);
		ret=1;
	}
	SMS_Service.SMS_read		= 0;
	SMS_Service.SMS_waitCounter = 3;
	SMS_Service.SMS_come		= 1;
	//SMS_Service.SMS_delALL		= 1;
	rt_free( pstrTemp );
	pstrTemp = RT_NULL;
	//////
	return ret;
}




/*********************************************************************************
*函数名称:u8 SMS_Tx_Text(char *strDestNum,char *s)
*功能描述:发送TEXT格式的短信函数
*输    入:s 原始短信数据，strDestNum接收方号码
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Tx_Text(char *strDestNum,char *s) 
{
	u16 len;
	char *pstrTemp;
	
	memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
	strcpy( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=\"" ); 
	//strcat(SMS_Service.SMSAtSend,"8613820554863");// Debug
	strcat(SMS_Service.SMSAtSend,strDestNum);
	strcat(SMS_Service.SMSAtSend,"\"\r\n");

	rt_kprintf("\r\n%s",SMS_Service.SMSAtSend); 
	rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );

	rt_thread_delay(50);
	
	pstrTemp=rt_malloc(150);
	memset(pstrTemp,0,150);
	len=strlen(s);
	memcpy(pstrTemp,s,len);
	pstrTemp[len++]=0x1A;      // message  end  

	///发送调试信息
	rt_device_write( &dev_vuart, 0, pstrTemp, len);
	///发送到GSM模块
	rt_hw_gsm_output_Data(pstrTemp, len); 
	rt_free( pstrTemp );
	pstrTemp=RT_NULL; 
	return 1;
}
//FINSH_FUNCTION_EXPORT(SMS_Tx_Text, SMS_Tx_Text);



/*********************************************************************************
*函数名称:u8 SMS_Tx_PDU(char *strDestNum,char *s)
*功能描述:发送PDU格式的短信函数
*输    入:s 原始短信数据，strDestNum接收方号码
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Tx_PDU(char *strDestNum,char *s)
{
	u16 len;
	u16 i;
	char *pstrTemp;
	memset(SMS_Service.SMSAtSend,0,sizeof(SMS_Service.SMSAtSend));
	pstrTemp=rt_malloc(400);
	memset(pstrTemp,0,400);
	i=0;
	SetPhoneNumToPDU(SMS_Service.Sms_Info.TPA, strDestNum, sizeof(SMS_Service.Sms_Info.TPA));
	len=AnySmsEncode_NoCenter(SMS_Service.Sms_Info.TPA,GSM_UCS2,s,strlen(s),pstrTemp);
	//len=strlen(pstrTemp);
	pstrTemp[len++]=0x1A;      // message  end  	
	//////
	sprintf( ( char * ) SMS_Service.SMSAtSend, "AT+CMGS=%d\r\n", (len-2)/2); 
	rt_kprintf("%s",SMS_Service.SMSAtSend); 
	rt_hw_gsm_output( ( char * ) SMS_Service.SMSAtSend );
	rt_thread_delay(50);
	//////	
	rt_device_write( &dev_vuart, 0, pstrTemp, strlen(pstrTemp) );
	//rt_hw_console_output(pstrTemp);
	rt_hw_gsm_output_Data(pstrTemp, len); 
	rt_free( pstrTemp );
	pstrTemp=RT_NULL;
	return 1;
}
//FINSH_FUNCTION_EXPORT(SMS_Tx_PDU, SMS_Tx_PDU);


/*********************************************************************************
*函数名称:u8 SMS_Rx_Notice(u16 indexNum)
*功能描述:模块收到新短信通知
*输    入:新短信的索引号
*输    出:none 
*返 回 值:	1:正常完成，
			0:表示失败
*作    者:白养民
*创建日期:2013-05-29
*---------------------------------------------------------------------------------
*修 改 人:
*修改日期:
*修改描述:
*********************************************************************************/
u8 SMS_Rx_Notice(u16 indexNum)
{
	SMS_Service.SMIndex=indexNum;
	rt_kprintf( " index=%d", SMS_Service.SMIndex );
	SMS_Service.SMS_read		= 3;
	SMS_Service.SMS_waitCounter = 1;
	return 1;
}


///测试函数，测试SMS短信接收处理命令解析的正确性
void SMS_Test(char * s)
{
	SMS_protocol(s,strlen(s),SMS_ACK_none);
}

FINSH_FUNCTION_EXPORT(SMS_Test, SMS_Test);

///测试函数，测试PDU数据包的接收解析功能
void SMS_PDU(char *s)
{
	u16 len;
	char *pstrTemp;
	pstrTemp=(char *)rt_malloc(160);	///短信解码后的完整内容，解码后汉子为GB码
	len=GsmDecodePdu(s,strlen(s),&SMS_Service.Sms_Info,pstrTemp);
	GetPhoneNumFromPDU( SMS_Service.SMS_destNum,  SMS_Service.Sms_Info.SCA, sizeof(SMS_Service.Sms_Info.SCA));
	rt_kprintf( "\r\n  短息中心号码:%s \r\n", SMS_Service.SMS_destNum );
	GetPhoneNumFromPDU( SMS_Service.SMS_destNum,  SMS_Service.Sms_Info.TPA, sizeof(SMS_Service.Sms_Info.TPA));
	rt_kprintf( "\r\n  短息来源号码:%s \r\n", SMS_Service.SMS_destNum );
	rt_kprintf( "\r\n 短信消息:\"%s\"\r\n",pstrTemp);
	rt_free( pstrTemp );
	pstrTemp = RT_NULL;
}
//FINSH_FUNCTION_EXPORT(SMS_PDU, SMS_PDU);
